# LOGISTIC REGRESSOR

IMPORTING LIBRARIES

In [22]:
import numpy as np
import pandas as pd

#########
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

######### libraries for plotting confusion matrix
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

######### libraries for filling missing values
from sklearn.impute import SimpleImputer

LOADING DATASET

In [2]:
dataset=pd.read_csv('/content/drive/My Drive/data/titanic.csv')
dataset.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

EXTRACTING RELEVENT COLUMNS

In [16]:
dataset=dataset[['pclass','age','sex','survived']]
dataset.head()

   pclass      age     sex  survived
0     1.0  29.0000  female       1.0
1     1.0   0.9167    male       1.0
2     1.0   2.0000  female       0.0
3     1.0  30.0000    male       0.0
4     1.0  25.0000  female       0.0

FINDING SHAPE OF DATA TO FIND NUMBER OF ROWS AND COLUMBS

In [8]:
dataset.shape

(1310, 4)

In [10]:
dataset.describe()

            pclass          age     survived
count  1309.000000  1046.000000  1309.000000
mean      2.294882    29.881135     0.381971
std       0.837836    14.413500     0.486055
min       1.000000     0.166700     0.000000
25%       2.000000    21.000000     0.000000
50%       3.000000    28.000000     0.000000
75%       3.000000    39.000000     1.000000
max       3.000000    80.000000     1.000000

FINDING HOW MANY NAN VALUES ARE THERE IN EACH COLUMN

In [11]:
print(dataset.isna().sum(axis=0))

pclass        1
age         264
sex           1
survived      1
dtype: int64

DROPPING LAST ROW AS IT CONTAIN ALL NULL VALUES

In [13]:
dataset=dataset.dropna(subset=['sex','pclass','survived'])

            pclass          age     survived
count  1309.000000  1046.000000  1309.000000
mean      2.294882    29.881135     0.381971
std       0.837836    14.413500     0.486055
min       1.000000     0.166700     0.000000
25%       2.000000    21.000000     0.000000
50%       3.000000    28.000000     0.000000
75%       3.000000    39.000000     1.000000
max       3.000000    80.000000     1.000000

AGAIN CHECKING FOR NAN VALUES IN DATASET

In [14]:
dataset.isna().sum(axis=0)

pclass        0
age         263
sex           0
survived      0
dtype: int64

PREPROCESSING : LABEL ENCODING BY USING MAP ASSIGNING "1" TO MALE AND "0" TO FEMALE

In [19]:
dataset['sex']=dataset['sex'].map({'male':1,'female':0})
dataset.head()

   pclass      age  sex  survived
0     1.0  29.0000    0       1.0
1     1.0   0.9167    1       1.0
2     1.0   2.0000    0       0.0
3     1.0  30.0000    1       0.0
4     1.0  25.0000    0       0.0

EXTRACTING x(FEATURES) ANS y(TARGET)

In [21]:
features=dataset[['pclass','age','sex']]
target=dataset[['survived']]

FILLING MISSING VALUES USING IMPUTER NY USING 'MEAN'

In [23]:
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')
features=imputer.fit_transform(features)

SPLITTING DATA INTO TRAIN AND TEST

In [24]:
features_train,features_test,target_train,target_test=train_test_split(features,target)

TRAINING THE MODEL

In [25]:
model=LogisticRegression()
model.fit(features_train,target_train)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

PREDICTING MODEL

In [29]:
predictions=model.predict(features_test)

PLOTTING CONFUSION MATRIX

In [31]:
print(confusion_matrix(target_test,predictions))
print(accuracy_score(target_test,predictions))

[[160  40]
 [ 34  94]]
0.774390243902439